'''
#BOJ 2163 초콜릿 자르기

[문제설명]
    a = 수록곡 수
    b = 저작권있는 멜로디 수
    avg = b / a 를 올림한 정수값

    avg와 a를 알때
    b의 최솟값을 구해라

[문제풀이]

[어려웠던 점 & 다시 공부할 부분]
    *문제가 '반올림'아니고 '올림'임. 문제 똑바로 읽자. 아래는 뻘짓하면서 얻은 것들.

    *int(x) 는 소수점이하는 버린다.

    *어떤 수가 정수인지 실수인지 구분
        if int(x) == x:
            #정수

    *실수를 정수부분 실수부분 구분
        (방법1) (비추) 정수 -> 문자열 -> . 기준으로 split
        (방법2) (추천) 정수부분 = int(x), 실수부분 = x - int(x)

    *어떤 소수보다 크거나 같은 정수 구하기
        if int(x)==x:
            result = int(x)
        else:
            result = int(x)+1

    *반올림한 수 x의 원래 값 범위
        x-0.5 <= 원래값 < x+0.5
'''

a, avg = map(int, input().split())

b = (avg-1)*a + 1

print(b)